tutorials/NACA0012/NACA00122D_4deg_v150/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

rm log.iceFoam


./createMesh

# Run it for a bit
runApplication $(getApplication)

#------------------------------------------------------------------------------
